In [1]:
import pandas as pd
import numpy as np

데이터 수집 -> 전처리(70%) -> 분석 -> 시각화 -> 알고리즘 선택 -> 모델링 -> 모델평가 및 개선  
<--------피드백---------->  
* 데이터 분석 목적에 부합되는 데이터 표(DF)로 작성  
* 측정한 데이터는 행 단위로 구성 (instance , 관측치)  
* 피처(feature)는 열(column)로 구성  
  
---  
ex) 주식 데이터 분석  
* 기업 정보 데이터 집합, 주식 가격 데이터 집합  
* 첨단 산업 기업의 주식 가격에 대한 데이터?  
* 기업 정보 -> 첨단 기술 보유 기업을 검색 <=연결=>주식 가격 검색

In [2]:
filepath='D:/downloads/데이터병합 연습문제 data/'
df1=pd.read_csv(filepath+'concat_1.csv')
df2=pd.read_csv(filepath+'concat_2.csv')
df3=pd.read_csv(filepath+'concat_3.csv')
rowdf=pd.concat([df1,df2,df3])
rowdf

     A    B    C    D
0   a0   b0   c0   d0
1   a1   b1   c1   d1
2   a2   b2   c2   d2
3   a3   b3   c3   d3
0   a4   b4   c4   d4
1   a5   b5   c5   d5
2   a6   b6   c6   d6
3   a7   b7   c7   d7
0   a8   b8   c8   d8
1   a9   b9   c9   d9
2  a10  b10  c10  d10
3  a11  b11  c11  d11

In [4]:
rowdf.loc[3]

     A    B    C    D
3   a3   b3   c3   d3
3   a7   b7   c7   d7
3  a11  b11  c11  d11

In [7]:
newRowSeries=pd.Series(['n1','n2','n3','n4'])
newRowSeries

0    n1
1    n2
2    n3
3    n4
dtype: object

In [11]:
pd.concat([df1,newRowSeries],axis=1)

    A   B   C   D   0
0  a0  b0  c0  d0  n1
1  a1  b1  c1  d1  n2
2  a2  b2  c2  d2  n3
3  a3  b3  c3  d3  n4

In [14]:
newRowDf=pd.DataFrame([['n1','n2','n3','n4']],columns=['A','B','C','D'])
pd.concat([df1,newRowDf])

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3
0  n1  n2  n3  n4

In [15]:
data_dict = {'A':'n1','B':'n2','C':'n3','D':'n4'}
data_dict

{'A': 'n1', 'B': 'n2', 'C': 'n3', 'D': 'n4'}

In [17]:
df1.append(data_dict,ignore_index=True)

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3
4  n1  n2  n3  n4

In [19]:
colConcat = pd.concat([df1,df2,df3],axis=1)
colConcat['A']

    A   A    A
0  a0  a4   a8
1  a1  a5   a9
2  a2  a6  a10
3  a3  a7  a11

In [22]:
newColList = ['n1','n2','n3','n4']
colConcat['newColList']=newColList
colConcat

    A   B   C   D   A   B   C   D    A    B    C    D newColList
0  a0  b0  c0  d0  a4  b4  c4  d4   a8   b8   c8   d8         n1
1  a1  b1  c1  d1  a5  b5  c5  d5   a9   b9   c9   d9         n2
2  a2  b2  c2  d2  a6  b6  c6  d6  a10  b10  c10  d10         n3
3  a3  b3  c3  d3  a7  b7  c7  d7  a11  b11  c11  d11         n4

In [23]:
site = pd.read_csv(filepath+'survey_site.csv')
visited = pd.read_csv(filepath+'survey_visited.csv')
person = pd.read_csv(filepath+'survey_person.csv')
survey = pd.read_csv(filepath+'survey_survey.csv')

In [25]:
visited_subset = visited.iloc[[0,2,6]]
visited_subset

   ident   site       dated
0    619   DR-1  1927-02-08
2    734   DR-3  1939-01-07
6    837  MSK-4  1932-01-14

In [27]:
site

    name    lat    long
0   DR-1 -49.85 -128.57
1   DR-3 -47.15 -126.72
2  MSK-4 -48.87 -123.40

In [29]:
pd.concat([visited_subset,site],axis=1)

   ident   site       dated   name    lat    long
0  619.0   DR-1  1927-02-08   DR-1 -49.85 -128.57
1    NaN    NaN         NaN   DR-3 -47.15 -126.72
2  734.0   DR-3  1939-01-07  MSK-4 -48.87 -123.40
6  837.0  MSK-4  1932-01-14    NaN    NaN     NaN

In [30]:
pd.merge(visited_subset,site,left_on='site',right_on='name')

   ident   site       dated   name    lat    long
0    619   DR-1  1927-02-08   DR-1 -49.85 -128.57
1    734   DR-3  1939-01-07   DR-3 -47.15 -126.72
2    837  MSK-4  1932-01-14  MSK-4 -48.87 -123.40

In [31]:
person.head(2)

  ident personal   family
0  dyer  William     Dyer
1    pb    Frank  Pabodie

In [32]:
survey.head(2)

   taken person quant  reading
0    619   dyer   rad     9.82
1    619   dyer   sal     0.13

In [35]:
ps = pd.merge(person,survey,left_on='ident',right_on='person')
vs = pd.merge(visited,survey,left_on='ident',right_on='taken')
ps

   ident   personal   family  taken person quant  reading
0   dyer    William     Dyer    619   dyer   rad     9.82
1   dyer    William     Dyer    619   dyer   sal     0.13
2   dyer    William     Dyer    622   dyer   rad     7.80
3   dyer    William     Dyer    622   dyer   sal     0.09
4     pb      Frank  Pabodie    734     pb   rad     8.41
5     pb      Frank  Pabodie    734     pb  temp   -21.50
6     pb      Frank  Pabodie    735     pb   rad     7.22
7     pb      Frank  Pabodie    751     pb   rad     4.35
8     pb      Frank  Pabodie    751     pb  temp   -18.50
9   lake   Anderson     Lake    734   lake   sal     0.05
10  lake   Anderson     Lake    751   lake   sal     0.10
11  lake   Anderson     Lake    752   lake   rad     2.19
12  lake   Anderson     Lake    752   lake   sal     0.09
13  lake   Anderson     Lake    752   lake  temp   -16.00
14  lake   Anderson     Lake    837   lake   rad     1.46
15  lake   Anderson     Lake    837   lake   sal     0.21
16   roe  Valentina  Roerich    752    roe   sal    41.60
17   roe  Valentina  Roerich    837    roe   sal    22.50
18   roe  Valentina  Roerich    844    roe   rad    11.25

In [36]:
vs.head(1)

   ident  site       dated  taken person quant  reading
0    619  DR-1  1927-02-08    619   dyer   rad     9.82

In [39]:
pvs = pd.merge(ps,vs,left_on=['ident','taken','quant','reading'],right_on=['person','ident','quant','reading'])
pvs

,ident_x,personal,family,taken_x,person_x,quant,reading,ident_y,site,dated,taken_y,person_y
0,dyer,William,Dyer,619,dyer,rad,9.82,619,DR-1,1927-02-08,619,dyer
1,dyer,William,Dyer,619,dyer,sal,0.13,619,DR-1,1927-02-08,619,dyer
2,dyer,William,Dyer,622,dyer,rad,7.80,622,DR-1,1927-02-10,622,dyer
3,dyer,William,Dyer,622,dyer,sal,0.09,622,DR-1,1927-02-10,622,dyer
4,pb,Frank,Pabodie,734,pb,rad,8.41,734,DR-3,1939-01-07,734,pb
5,pb,Frank,Pabodie,734,pb,temp,-21.50,734,DR-3,1939-01-07,734,pb
6,pb,Frank,Pabodie,735,pb,rad,7.22,735,DR-3,1930-01-12,735,pb
7,pb,Frank,Pabodie,751,pb,rad,4.35,751,DR-3,1930-02-26,751,pb
8,pb,Frank,Pabodie,751,pb,temp,-18.50,751,DR-3,1930-02-26,751,pb
9,lake,Anderson,Lake,734,lake,sal,0.05,734,DR-3,1939-01-07,734,lake
10,lake,Anderson,Lake,751,lake,sal,0.10,751,DR-3,1930-02-26,751,lake
11,lake,Anderson,Lake,752,lake,rad,2.19,752,DR-3,NaN,752,lake
12,lake,Anderson,Lake,752,lake,sal,0.09,752,DR-3,NaN,752,lake
13,lake,Anderson,Lake,752,lake,temp,-16.00,752,DR-3,NaN,752,lake
14,lake,Anderson,Lake,837,lake,rad,1.46,837,MSK-4,1932-01-14,837,lake
15,lake,Anderson,Lake,837,lake,sal,0.21,837,MSK-4,1932-01-14,837,lake
16,roe,Valentina,Roerich,752,roe,sal,41.60,752,DR-3,NaN,752,roe
17,roe,Valentina,Roerich,837,roe,sal,22.50,837,MSK-4,1932-01-14,837,roe
18,roe,Valentina,Roerich,844,roe,rad,11.25,844,DR-1,1932-03-22,844,roe

In [40]:
df=pd.DataFrame(np.arange(10).reshape(5,2),
               index=['a','b','c','d','e'],
               columns=['C1','C2'])
df

   C1  C2
a   0   1
b   2   3
c   4   5
d   6   7
e   8   9

In [41]:
# b,e 행 c1열에 'None' 저장
# b,c 행 c2열에 'None' 저장

df.loc[['b','e'],'C1']=None
df.loc[['b','c'],'C2']=None
df

    C1   C2
a  0.0  1.0
b  NaN  NaN
c  4.0  NaN
d  6.0  7.0
e  NaN  9.0

In [43]:
df.mean(axis=1) # mean , std 의 계산에서 NaN 은 0 처리가 아니라 아예 제외

a    0.5
b    NaN
c    4.0
d    6.5
e    9.0
dtype: float64

In [47]:
df['C3']=df['C1']+df['C2']
df2 = pd.DataFrame({'C1':[1,1,1,1,1],
                   'C4':[1,1,1,1,1]},
                   index=['a','b','c','d','e'])
print(df)
print(df2)
print(df+df2)

    C1   C2    C3
a  0.0  1.0   1.0
b  NaN  NaN   NaN
c  4.0  NaN   NaN
d  6.0  7.0  13.0
e  NaN  9.0   NaN
   C1  C4
a   1   1
b   1   1
c   1   1
d   1   1
e   1   1
    C1  C2  C3  C4
a  1.0 NaN NaN NaN
b  NaN NaN NaN NaN
c  5.0 NaN NaN NaN
d  7.0 NaN NaN NaN
e  NaN NaN NaN NaN

In [48]:
df=pd.DataFrame(np.random.rand(5,3),
            columns=['c1','c2','c3'])
df

         c1        c2        c3
0  0.576455  0.526020  0.336771
1  0.125458  0.249850  0.639126
2  0.990453  0.653234  0.491609
3  0.813550  0.841791  0.126663
4  0.691206  0.388858  0.805954

In [51]:
df.loc[1,['c1','c3']]=None
df.loc[[2,3],'c2']=None
df.loc[4,'c3']=None
df

         c1        c2        c3
0  0.576455  0.526020  0.336771
1       NaN  0.249850       NaN
2  0.990453       NaN  0.491609
3  0.813550       NaN  0.126663
4  0.691206  0.388858       NaN

In [50]:
dfMissing = df.fillna('missing')
dfMissing

         c1        c2        c3
0  0.576455  0.526020  0.336771
1   missing  0.249850   missing
2  0.990453  0.653234  0.491609
3   0.81355  0.841791  0.126663
4  0.691206  0.388858  0.805954

In [52]:
df.mean()

c1    0.767916
c2    0.388243
c3    0.318348
dtype: float64

In [53]:
df.fillna(df.mean()) # 각 열의 결측값은 각 열의 평균값으로 채워짐

         c1        c2        c3
0  0.576455  0.526020  0.336771
1  0.767916  0.249850  0.318348
2  0.990453  0.388243  0.491609
3  0.813550  0.388243  0.126663
4  0.691206  0.388858  0.318348

In [56]:
np.where(df.isnull(),df.mean(),df)

array([[0.57645472, 0.52602011, 0.33677139],
       [0.76791599, 0.24985011, 0.31834789],
       [0.99045342, 0.3882428 , 0.49160897],
       [0.81354998, 0.3882428 , 0.12666331],
       [0.69120584, 0.38885819, 0.31834789]])

In [62]:
df.where(df.notnull(),df.mean(),axis='columns') # 조건에 맞지 않는 항목에 대해서만 조작 가능?

         c1        c2        c3
0  0.576455  0.526020  0.336771
1  0.767916  0.249850  0.318348
2  0.990453  0.388243  0.491609
3  0.813550  0.388243  0.126663
4  0.691206  0.388858  0.318348

In [63]:
df.fillna(df.mean()['c1'])

         c1        c2        c3
0  0.576455  0.526020  0.336771
1  0.767916  0.249850  0.767916
2  0.990453  0.767916  0.491609
3  0.813550  0.767916  0.126663
4  0.691206  0.388858  0.767916

In [68]:
df2=pd.DataFrame({'c1':[1,2,3,4,5],
             'c2':[6,7,8,9,10]})
df2

   c1  c2
0   1   6
1   2   7
2   3   8
3   4   9
4   5  10

In [69]:
# 7,9 자리에 np.nan 할당
df2.loc[[1,3],'c2']=np.nan
df2

   c1    c2
0   1   6.0
1   2   NaN
2   3   8.0
3   4   NaN
4   5  10.0

In [70]:
df2['c2new']=np.where(df2['c2'].isnull(),df2['c1'],df2['c2'])
df2

   c1    c2  c2new
0   1   6.0    6.0
1   2   NaN    2.0
2   3   8.0    8.0
3   4   NaN    4.0
4   5  10.0   10.0

In [71]:
# for문으로 위와 동일한 동작
df2['c2new_for'] = np.array([df2['c2'][i] if pd.notnull(df2['c2'][i]) else df2['c1'][i] for i in range(len(df2['c2']))])
df2

   c1    c2  c2new  c2new_for
0   1   6.0    6.0        6.0
1   2   NaN    2.0        2.0
2   3   8.0    8.0        8.0
3   4   NaN    4.0        4.0
4   5  10.0   10.0       10.0

In [72]:
df=pd.DataFrame(np.random.randn(5,4),
            columns=['c1','c2','c3','c4'])
df.loc[[0,1],'c1']=None
df.loc[2,'c2']=None
df

         c1        c2        c3        c4
0       NaN -0.293744 -2.050140 -1.464678
1       NaN  0.860076 -0.775096  0.498610
2 -0.870029       NaN  3.040747  1.358330
3  0.950736  0.412014 -1.514440 -1.004524
4 -0.730390 -1.933588 -0.682697 -1.043159

In [76]:
# 결측값 있는 행 전체 제거
df.dropna(axis=0)

         c1        c2        c3        c4
3  0.950736  0.412014 -1.514440 -1.004524
4 -0.730390 -1.933588 -0.682697 -1.043159

---  
__interpolate : 결측값을 선형적으로 보간하는 함수__  
* 1 nan nan 7 => 1 3 5 7  
---

In [77]:
from datetime import datetime

In [78]:
datestr = ["09/09/2020","09/11/2020","09/12/2020","09/18/2020"]

In [81]:
dates=pd.to_datetime(datestr)
dates

DatetimeIndex(['2020-09-09', '2020-09-11', '2020-09-12', '2020-09-18'], dtype='datetime64[ns]', freq=None)

In [83]:
ts=pd.Series([1,np.nan,np.nan,10],index=dates)
ts

2020-09-09     1.0
2020-09-11     NaN
2020-09-12     NaN
2020-09-18    10.0
dtype: float64

In [84]:
ts_linear = ts.interpolate() # default : method='values'
ts_linear

2020-09-09     1.0
2020-09-11     4.0
2020-09-12     7.0
2020-09-18    10.0
dtype: float64

In [85]:
ts.interpolate(method='values')

2020-09-09     1.0
2020-09-11     3.0
2020-09-12     4.0
2020-09-18    10.0
dtype: float64

In [86]:
ts.interpolate(method='time')

2020-09-09     1.0
2020-09-11     3.0
2020-09-12     4.0
2020-09-18    10.0
dtype: float64

In [88]:
ts.interpolate(method='linear') # 실제는 knn 혹은 regression 모델 활용으로 결측값 대체하는것이 일반적

2020-09-09     1.0
2020-09-11     4.0
2020-09-12     7.0
2020-09-18    10.0
dtype: float64

__Replace : 값을 찾아 대체__  
* DataFrame.replace('origin_val','new_val')  
---

In [89]:
ser = pd.Series([1,2,3,4,np.nan])
ser

0    1.0
1    2.0
2    3.0
3    4.0
4    NaN
dtype: float64

In [91]:
ser.replace(np.nan,10)

0     1.0
1     2.0
2     3.0
3     4.0
4    10.0
dtype: float64

In [92]:
ser.replace([1,2,3],[4,5,6])  # 리스트로도 전달 가능

0    4.0
1    5.0
2    6.0
3    4.0
4    NaN
dtype: float64

In [93]:
ser.replace({1:20,2:20,3:40}) # 딕셔너리 구조로 1:1 mapping 문법도 전달 가능

0    20.0
1    20.0
2    40.0
3     4.0
4     NaN
dtype: float64

In [94]:
# 데이터프레임의 특정 컬럼값 교체
df = pd.DataFrame({'c1':['a_old','b','c','d','e'],
             'c2':[1,2,3,4,5],
             'c3':[6,7,8,9,np.nan]})
df

      c1  c2   c3
0  a_old   1  6.0
1      b   2  7.0
2      c   3  8.0
3      d   4  9.0
4      e   5  NaN

In [95]:
df.replace({'c1':'a_old'},{'c1':'a_new'})

      c1  c2   c3
0  a_new   1  6.0
1      b   2  7.0
2      c   3  8.0
3      d   4  9.0
4      e   5  NaN

In [96]:
# c3 열의 nan 값을 10으로 변경
df.replace({'c3':np.nan},{'c3':10})

      c1  c2    c3
0  a_old   1   6.0
1      b   2   7.0
2      c   3   8.0
3      d   4   9.0
4      e   5  10.0

__중복값 처리__  
* 여부 확인 : duplciated()  
* 처리 : drop_duplicates() , 1개만 남기고 나머지 제거  
---

In [97]:
df = {'key1':['a','b','c','d','e'],
     'key2':['v','w','w','x','y'],
     'col':[1,2,3,4,5]}
df

{'key1': ['a', 'b', 'c', 'd', 'e'],
 'key2': ['v', 'w', 'w', 'x', 'y'],
 'col': [1, 2, 3, 4, 5]}

In [99]:
df=pd.DataFrame(df)
df

  key1 key2  col
0    a    v    1
1    b    w    2
2    c    w    3
3    d    x    4
4    e    y    5

In [103]:
df.duplicated('key2')  # 칼럼명을 전달하여 확인

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [105]:
df.duplicated(['key1','key2']) # 계층적으로도 전달 가능

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [108]:
# df.duplicated('key2')  default option -> keep = 'first' , 중복된 값들 중에 어느것을 남길것인가 (first, last, False)
print(df.duplicated('key2',keep='last'))
print(df.duplicated('key2',keep=False))

0    False
1     True
2    False
3    False
4    False
dtype: bool
0    False
1     True
2     True
3    False
4    False
dtype: bool

In [109]:
df.drop_duplicates('key2')

  key1 key2  col
0    a    v    1
1    b    w    2
3    d    x    4
4    e    y    5

__unique : 유일값 추출__

In [110]:
df = pd.DataFrame({'a':['a1','a1','a2','a2','a3','a3'],
             'b':['b1','b1','b1','b1','b2',np.nan],
             'c':[1,1,3,4,4,4]})
df

    a    b  c
0  a1   b1  1
1  a1   b1  1
2  a2   b1  3
3  a2   b1  4
4  a3   b2  4
5  a3  NaN  4

In [111]:
df['a'].unique()

array(['a1', 'a2', 'a3'], dtype=object)

In [113]:
# df.unique() -> Error : unique 함수는 시리즈에만 적용 가능하다.

In [116]:
df['a'].value_counts()

a3    2
a1    2
a2    2
Name: a, dtype: int64

In [117]:
df['b'].value_counts(dropna=False) # 따로 옵션을 주지 않으면 nan 값은 카운팅 되지 않음

b1     4
b2     1
NaN    1
Name: b, dtype: int64

In [119]:
df['c'].value_counts(normalize=True) # 각 값이 유일한 값들 중 어느정도 비율을 차지하는지

4    0.500000
1    0.333333
3    0.166667
Name: c, dtype: float64

In [121]:
df['c'].value_counts(ascending=True)

3    1
1    2
4    3
Name: c, dtype: int64

In [123]:
df['c'].value_counts(bins=[1,2,3,4])
# 구간 - ():개구간(포함X) , []:폐구간(포함O)
#ex) (3.0,4.0] : 3초과 4이하

(3.0, 4.0]      3
(0.999, 2.0]    2
(2.0, 3.0]      1
Name: c, dtype: int64

In [124]:
out = pd.cut(df['c'],bins=[1,2,3,4,5])
out

0           NaN
1           NaN
2    (2.0, 3.0]
3    (3.0, 4.0]
4    (3.0, 4.0]
5    (3.0, 4.0]
Name: c, dtype: category
Categories (4, interval[int64]): [(1, 2] < (2, 3] < (3, 4] < (4, 5]]